import { View, Text, FlatList } from "react-native";

const Bleeding = () => {
  return (
    <View style={{ flex: 1 }}>
      <FlatList
        data={[
          {
            id: 1,
            key: "Άμεση πίεση στο σημείο με ένα επίθεμα, μια αποστειρωμένη γάζα, με ένα οποιοδήποτε ύφασμα-πανί. ",
          },
          {
            id: 2,
            key: "Εάν ματώσει το πρώτο επίθεμα και είναι τελείως μούσκεμα από το αίμα, αφαιρούμε και βάζουμε άλλο στεγνό. Αυτό γίνεται μόνο για το πρώτο και μοναδικό επίθεμα και όχι στα παιδιά  ",
          },
          {
            id: 3,
            key: "Εάν συνεχίζει να ματώνει το επίθεμα προσθέτουμε και άλλο από επάνω. Δεν αφαιρούμε πλέον κανένα άλλο.  ",
          },
          {
            id: 4,
            key: "Επίδεση του επιθέματος με έναν επίδεσμο. ",
          },
          {
            id: 5,
            key: "Εάν ματώσει ο επίδεσμος δεν τον αφαιρούμε και προσθέτουμε στο σημείο και άλλο επίθεμα και άλλον επίδεσμο. ",
          },
          {
            id: 6,
            key: "Εάν συνεχίζει η αιμορραγία και με την καινούργια επίδεση δεν την αφαιρούμε και πάμε ψηλότερα από το σημείο που αιμορραγεί και εφαρμόζουμε ίσχαιμο περίδεση.",
          },
          {
            id: 7,
            key: "Η ίσχαιμος περίδεση εφαρμόζεται ως εξής:~Με έναν φαρδύ επίδεσμο ή ένα φαρδύ κομμάτι υφάσματος τυλίγουμε σφιχτά ψηλότερα και κεντρικότερα του σημείου που αιμορραγεί και δένουμε με κόμπο. ~ Τοποθετούμε πάνω στο κόμπο ένα κομμάτι ξύλου, ή ένα μαρκαδόρο και σταθεροποιούμε το αντικείμενο με κόμπο. ~ Γυρίζουμε γύρω- γύρω σαν βίδα σφιχτά μέχρι να σταματήσει η αιμορραγία . ~ Η σωστή επίδεση πονάει τον τραυματία. ~ Εάν και πάλι δεν σταματήσει και εφόσον έχουμε χώρο εφαρμόζουμε και άλλη ίσχαιμο περίδεση~ Ποτέ δεν αφαιρούμε οτιδήποτε έχουμε εφαρμόσει για έλεγχο της αιμορραγίας. ",
          },
        ]}
        renderItem={({ item }) => (
          <View>
            <Text style={{ fontWeight: "bold", color: "green", fontSize: 30 }}>
              Βήμα {item.id}:
            </Text>
            <View
              style={{
                marginBottom: 10,
                //   padding: 10,
                //   fontSize: 18,
                //   height: 60,
                //   justifyContent: "center",
                //   display: "flex",
                //   flexDirection: "row",
                //   justifyContent: "space-between",
                borderBottomWidth: 0.2,
              }}
              key={item}
            >
              <Text style={{ fontSize: 20 }}>{item.key}</Text>
            </View>
          </View>
        )}
      />
      {/* Για παιδια από 1-8 ετών: Τα
        ηλεκτρόδια τοποθετούνται μπροστά στο στέρνο και πίσω στην πλάτη. Χρήση
        παιδιατρικών ηλεκτροδίων σε περίπτωση που είναι διαθέσιμα
      </Text> */}
    </View>
  );
};

export default Bleeding;
