import { View, Text } from "react-native";

const Burn = () => {
  return (
    <View>
      <Text>
        Ασφάλεια χώρου, διασώστη και θύματος Απομάκρυνση του θύματος από το
        αίτιο, στις περιπτώσεις όπου το έγκαυμα προκλήθηκε μετά από τροχαίο,
        έκρηξη, κ.ά. το θύμα πρέπει να θεωρηθεί ότι φέρει και άλλες κακώσεις.
        Αφαιρούνται κοσμήματα, ζώνες που βρίσκονται στην εγκαυματική περιοχή.
        Χορήγηση αντιτετανικού ορού εάν δεν έχει γίνει αντιτετανικό εμβόλιο. Τα
        επιφανειακά και μερικού πάχους εγκαύματα που καταλαμβάνουν μικρή
        επιφάνεια πλένονται με άφθονο δροσερό νερό 10 με 15 λεπτά Απομακρύνονται
        τυχόν υπολείμματα όπως καμένα ρούχα, όσα απομακρύνονται εύκολα.
        Απλώνεται καταπραϋντικό gel (hydrogel). Δεν σπάμε τις φουσκάλες, εάν
        σπάσουν οι φουσκάλες απλώνουμε αντισηπτική αλοιφή και καλύπτουμε με
        γάζες. Εάν υπάρχει έντονος πόνος δίνεται ένα παυσίπονο. Εξαίρεση
        αποτελούν τα επιφανειακά και μερικού πάχους εγκαύματα που αφορούν το
        πρόσωπο και τα γεννητικά όργανα όπου πρέπει να αναζητείται ιατρική
        βοήθεια. Χορήγηση αντιτετανικού ορού εάν δεν έχει γίνει αντιτετανικό
        εμβόλιο. Τα ολικού πάχους εγκαύματα πλένονται με άφθονο δροσερό νερό 10
        με 15 λεπτά. Απομακρύνονται τυχόν υπολείμματα όπως καμένα ρούχα, όσα
        απομακρύνονται εύκολα. Καλύπτουμε με γάζες αντισηπιτικές. Εάν υπάρχει
        έντονος πόνος δίνεται ένα παυσίπονο Χορήγηση αντιτετανικού ορού εάν δεν
        έχει γίνει αντιτετανικό εμβόλιο. Αναζητείται ιατρική βοήθεια.
      </Text>
    </View>
  );
};

export default Burn;
