import { View, Text } from "react-native";

const Shock = () => {
  return (
    <View>
      <Text>
        Φροντίζουμε για την ασφάλεια, χώρου, διασώστη και θύματος. Διακόπτουμε
        το ηλεκτρικό ρεύμα, το υψηλής τάσης ρεύμα μπορεί να μεταδοθεί για αρκετά
        μέτρα γύρω από το θύμα. Ψάχνουμε να βρούμε τον γενικό διακόπτη του
        ηλεκτρικού ρεύματος και τον κατεβάζουμε. Εάν δεν είναι αυτό εφικτό
        ψάχνουμε έναν στεγνό κακό αγωγό του ηλεκτρικού ρεύματος (ξύλο, πλαστικό,
        σκουπόξυλο, σανίδα κρεβατιού κλπ), ώστε να απομακρύνουμε τον αγωγό του
        ηλεκτρικού ρεύματος ή το θύμα Εάν το θύμα βρίσκεται μέσα σε νερά και δεν
        έχουμε εύκολη πρόσβαση σε αυτόν προσπαθούμε να βρούμε μια σανίδα για να
        πατήσουμε πάνω Πάνω από όλα μας ενδιαφέρει η ασφάλεια μας ώστε να μην
        γίνουμε και εμείς θύματα. Απελευθερώνουμε τον αεραγωγό, (οι γνωστοί
        χειρισμοί), όταν έχουμε απώλεια αισθήσεων. Έλεγχος αναπνοής, ψάχνουμε
        για κάποια κίνηση, βήχα και φυσιολογική αναπνοή. Στην περίπτωση που δεν
        υπάρχει κυκλοφορία ή υπάρχει αμφιβολία αρχίζουμε ΚΑΡΠΑ. Εάν αναπνέει
        κανονικά, αφαιρούμε τα ενδύματα του θύματος ελέγχουμε, για εγκαύματα
        στην είσοδο και στην έξοδο του ηλεκτρικού ρεύματος και για τραύματα από
        την πιθανή εκτίναξη μετά την είσοδο του ηλεκτρικού ρεύματος στον
        ανθρώπινο οργανισμό. Προστασία από την υποθερμία Όποιος έχει υποστεί
        ηλεκτροπληξία ή κεραυνοπληξία πρέπει να αναζητήσει ιατρική φροντίδα.
      </Text>
    </View>
  );
};

export default Shock;
